'''
Книжные магазины предлагают следующие коллекции книг.
Магистр – Лермонтов, Достоевский, Пушкин, Тютчев
ДомКниги – Толстой, Грибоедов, Чехов, Пушкин.
БукМаркет – Пушкин, Достоевский, Маяковский.
Галерея – Чехов, Тютчев, Пушкин.
Определить в каких магазинах
нельзя приобрести книги Грибоедова и Маяковского
'''
magistr = {"Лермонтов", "Достоевский", "Пушкин", "Тютчев"}
domBook = {"Толстой", "Грибоедов", "Чехов", "Пушкин"}
bookMarket = {"Пушкин", "Достоевский", "Маяковский"}
galery = {"Чехов", "Тютчев", "Пушкин"}

need_book = {"Грибоедов", "Маяковский"}

print("Магазины, где нельзя приобрести книги Грибоедова и Маяковского:")
if not need_book & magistr:
    print("Магистр")
if not need_book & domBook:
    print("ДомКниги")
if not need_book & bookMarket:
    print("БукМаркет")
if not need_book & galery:
    print("Галерея")
