'''
Книжные магазины предлагают следующие коллекции книг.
Магистр – Лермонтов, Достоевский, Пушкин, Тютчев
ДомКниги – Толстой, Грибоедов, Чехов, Пушкин.
БукМаркет – Пушкин, Достоевский, Маяковский.
Галерея – Чехов, Тютчев, Пушкин.
Определить в каких магазинах
нельзя приобрести книги Грибоедова и Маяковского
'''
magistr = {"Лермонтов", "Достоевский", "Пушкин", "Тютчев"}
domBook = {"Толстой", "Грибоедов", "Чехов", "Пушкин"}
bookMarket = {"Пушкин", "Достоевский", "Маяковский"}
galery = {"Чехов", "Тютчев", "Пушкин"}

need_book = {"Грибоедов", "Маяковский"}
