'''
 Дана арифметическая прогрессия а1=1, а2=4, а3=7, а4 =10, а5 =13, ... Составить
программу, которая каждый элемент прогрессии разделит на 2 и результат округлит
до ближайшего целого.
'''
a1 = 1
d = 3

while True:
    try:
        n = int(input("Введите количество элементов прогрессии: "))
        if n <= 0:
            print("Количество должно быть положительным!")
            continue
        break
    except ValueError:
        print("Введите целое число!")

print("Результаты деления элементов прогрессии на 2 с округлением:")

i = 0
while i < n:
    ai = a1 + i * d
    result = round(ai / 2)
    print(f"a{i+1} = {ai} → {ai}/2 = {result}")
    i += 1
