'''
Ввести 4 числа. Найти и вывести на экран количество четных чисел.
'''
try:
    a = float(input("Введите первое число: "))
    b = float(input("Введите второе число: "))
    c = float(input("Введите третье число: "))
    d = float(input("Введите четвёртое число: "))

    k = 0
    if a % 2 == 0:
        k = k + 1
    if b % 2 == 0:
        k = k + 1
    if c % 2 == 0:
        k = k + 1
    if d % 2 == 0:
        k = k + 1
    print(f"Количество чётных чисел: {k}")

except ValueError:
        print("Ошибка. Пожалуйста, введите число заново.")