'''
Даны два целых числа А и В (А < В). Вывести в порядке убывания все целые числа,
расположенные между А и В (включая сами числа А и В), а также количество этих
чисел (использовать оператор цикла).
'''
while True:
    try:
        a = int(input("Введите первое целое число: "))
        b = int(input("Введите второе целое число: "))
        if a >= b:
            print("Первое число должно быть меньше второго числа! Попробуйте снова.")
            continue
        break
    except ValueError:
        print("Введите целые числа!")

total = 0
current = b

while current >= a:
    print(current)
    total = total + 1
    current = current - 1
print(f"Количество чисел: {total}")
