'''
Ввести 4 числа. Найти и вывести на экран сумму и количество отрицательных чисел.
'''
try:
    a = float(input("Введите первое число: "))
    b = float(input("Введите второе число: "))
    c = float(input("Введите третье число: "))
    d = float(input("Введите четвёртое число: "))

    summ = a + b + c + d
    print(f"Сумма всех чисел равна {summ}")

    k = 0
    if a < 0:
        k = k + 1
    if b < 0:
        k = k + 1
    if c < 0:
        k = k + 1
    if d < 0:
        k = k + 1
    print(f"Количество отрицательных чисел: {k}")
except ValueError:
    print("Ошибка. Введите число.")