'''
Даны температуры за месяц март. Необходимо найти количество положительных
и отрицательных значений температур в месяце, самую низкую и самую высокую
температуры, а также среднемесячное значение температуры
'''
temp = [12, -2, 20, 9, -1, 7, 11]
print(f'Температуры за март месяц: {temp}')
pol = [i for i in temp if i > 0]
print(f'Количество положительных температур за март: {len(pol)}')
otr = [i for i in temp if i < 0]
print(f'Количество отрицательных температур за март: {len(otr)}')
print(f'Самая высокая температура за март: {max(pol)}')
print(f'Самая низкая температура за март: {min(otr)}')
print(f'Среднемесячная температура за март: {sum(temp)/len(temp)}')
