#Даны два целых числа: A, B. Проверить истинность высказывания: «Справедливы
#неравенства A > 0 или B < —2».
A = int(input("Введите число: "))
B = int(input("Введите число: "))
if A > 0 or B < -2:
    print("Неравенства справедливы")
else:
    print("Неравенства не справедливы")