'''
Дано целое число. Если оно является положительным, то прибавить к нему 20, в
противном случае вычесть из него 5.
'''
try:
    num = int(input("Введите целое число: "))

    if num > 0:
        op = num + 20
        print(op)
    else:
        op_2 = num - 5
        print(op_2)

except ValueError:
    print("Ошибка. Введите целое число.")
