'''
Даны целые числа N (>2), A и B. Сформировать и вывести целочисленный список 
размера 10, первый элемент которого равен A, второй равен B, а каждый 
последующий элемент равен сумме всех предыдущих.
'''
try:
    N = int(input("Введите N (> 2): "))
    A = int(input("Введите A: "))
    B = int(input("Введите B: "))

    if N <= 2:
        print("Ошибка: N должно быть больше 2.")
    else:
        lst = [A, B]
        for i in range(8):
            lst.append(sum(lst))

        print("Список:", lst)

except ValueError:
    print("Упс. Произошла ошибка. Введите целое число.")
