'''
Дан список размера N и целое число K (1 < K < N). Осуществить сдвиг элементов 
список вправо на K позиций (при этом A1 перейдет в AK+1, A2 — в AK+2, ..AN-K — в 
AN, а исходное значение K последних элементов будет потеряно). Первые K 
элементов полученного списка положить равными 0.
'''
N = int(input("Введите размер списка N: "))
K = int(input("Введите K (1 < K < N): "))

if not (1 < K < N):
    print("Ошибка: должно выполняться условие 1 < K < N")
else:
    A = list(map(int, input(f"Введите {N} целых чисел через пробел: ").split()))

    if len(A) != N:
        print("Ошибка: количество введённых чисел не совпадает с N")
    else:
        new_A = [0] * K + A[:N - K]

        print(new_A)
