'''
Дан список размера N и целое число K (1 < K < N). Осуществить сдвиг элементов 
список вправо на K позиций (при этом A1 перейдет в A(K+1), A2 — в A(K+2), ..A(N-K) — в 
AN, а исходное значение K последних элементов будет потеряно). Первые K 
элементов полученного списка положить равными 0.
'''
import random

try:
    N = int(input("Введите размер списка N: "))
    K = int(input("Введите K (1 < K < N): "))
    A = []

    if N <= 2:
        print("Ошибка: N должно быть больше 2 (так как 1 < K < N).")
    elif not (1 < K < N):
        print("Ошибка: должно выполняться условие 1 < K < N.")
    else:
        i = 0
        while i < N:
            num = random.randint(-50, 50)
            A.append(num)
            i += 1
        print("Исходный список:", A)

        result = [0] * K + A[:N - K]

        print("Результат после сдвига:", result)

except ValueError:
    print("Ошибка: введите целые числа для N и K.")
