'''
Дан список размера N и целое число K (1 < K < N). Осуществить сдвиг элементов 
список вправо на K позиций (при этом A1 перейдет в AK+1, A2 — в AK+2, ..AN-K — в 
AN, а исходное значение K последних элементов будет потеряно). Первые K 
элементов полученного списка положить равными 0.
'''
import random

try:
    N = int(input("Введите размер списка N: "))
    K = int(input("Введите K (1 < K < N): "))

    if N <= 2:
        print("Ошибка: N должно быть больше 2 (так как 1 < K < N).")
    elif not (1 < K < N):
        print("Ошибка: должно выполняться условие 1 < K < N.")
    else:
        A = [random.randint(-50, 50) for _ in range(N)]
        print("Исходный список:", A)

        new_A = [0] * K + A[:N - K]

        print("Результат после сдвига:", new_A)

except ValueError:
    print("Ошибка: введите целые числа для N и K.")
