# Дано расстояние L в сантиметрах. Используя операцию деления нацело, найти количество полных метров в нем (1 метр =100 см).
try:
    L = int(input('Введите рассояние в сантиметрах: '))

    if L < 0:
        print('К сожалению, расстояние не может быть отрицательным. Попробуйте снова.')
    else:
        meters = L // 100
        print('Количество полных метров:', meters)

except ValueError:
    print('Пожалуйста, введите целое число.')
