'''
Средствами языка Python сформировать текстовый файл (.txt), содержащий
последовательность из целых положительных и отрицательных чисел. Сформировать
новый текстовый файл (.txt) следующего вида, предварительно выполнив требуемую
обработку элементов:
Исходные данные:
Количество элементов:
Произведение элементов:
Повторяющиеся элементы:
Количество повторяющихся элементов:
Элементы больше 5 увеличены в два раза:
'''
l = ["-12 3 57 -8 9 53 -2 23"]
f1 = open("data_1.txt", "w")
f1.writelines(l)
f1.close()

#иСХОДНЫЕ ДАННЫЕ
f2 = open('data_2.txt', 'w')
f2.write('Исходные данные: ')
f2.write('\n')
f2.writelines(l)
f2.close()

#КОЛИЧЕСТВО ЭЛЕМЕНТОВ
f1 = open('data_1.txt')
k = f1.read()
k = k.split()
for i in range(len(k)):
    k[i] = int(k[i])
f1.close()

#ПРОИЗВЕДЕНИЕ ЭЛЕМЕНТОВ ТТ
f1 = open('data_1.txt')
k = f1.read()
k = k.split()
t = 1
for i in range(len(k)):  #ЧТО-ТО НАДО ПОМЕНЯТЬ, НО ПОКА МНЕ ЛЕНЬ
    t = t * int(i)
print(t)
f1.close()

#ПОВТОРЯЮЩИЕСЯ ЭЛЕМЕНТЫ 
f1 = open('data_1.txt')
k = f1.read()
k = k.split()
n = 0
for i in range(len(k)):
    if i==i:
        n += 1
f1.close()
